#include "bits/stdc++.h"
using namespace std;
typedef long long ll;
typedef pair<int, int> pii;
typedef pair<ll, ll> pll;
#define INF 1<<30
#define LINF 1LL<<60

/*
<url:http://judge.u-aizu.ac.jp/onlinejudge/description.jsp?id=0357>
問題文============================================================

 兄弟であるＡ君とＢ君は、毎年それぞれお年玉をもらっています。
 とても仲の良い２人は、２人のお年玉を足し合わせて半分ずつに分けています。
 ２人がもらうお年玉の金額は、それぞれ1000 の倍数です。
 
 Ａ君とＢ君がもらった金額が与えられたとき、１人当たりが得る金額を出力するプログラムを作成せよ。
 
 １行に、Ａ君がもらった金額 a (1000 ≤ a ≤ 50000) とＢ君がもらった金額 b (1000 ≤ b ≤ 50000) が与えられる。
=================================================================

解説=============================================================
hai
================================================================
*/
int main(void) {
	cin.tie(0); ios::sync_with_stdio(false);
    ll a,b; cin >> a >> b;
    cout << (a+b)/2 << endl;
	return 0;
}
