#include "bits/stdc++.h"
using namespace std;
typedef long long ll;
typedef pair<int, int> pii;
typedef pair<ll, ll> pll;
#define INF 1<<30
#define LINF 1LL<<60

/*
 <url:>
 問題文============================================================
 太郎君はよくJOI雑貨店で買い物をする．
 JOI雑貨店には硬貨は500円，100円，50円，10円，5円，1円が十分な数だけあり，
 いつも最も枚数が少なくなるようなおつりの支払い方をする．
 太郎君がJOI雑貨店で買い物をしてレジで1000円札を1枚出した時，
 もらうおつりに含まれる硬貨の枚数を求めるプログラムを作成せよ．
 =================================================================
 解説=============================================================
 やるだけ
 ================================================================
 */

int main(void) {
    cin.tie(0); ios::sync_with_stdio(false);
    ll N;
    int K[6] = {500,100,50,10,5,1};
    while(cin >> N,N){
        int res = 0;
        N = 1000 - N;
        for(int i = 0; i < 6;i++){
            res += N/K[i];
            N %= K[i];
        }
        cout << res << endl;
    }
    return 0;
}
