#include "bits/stdc++.h"
using namespace std;
typedef long long ll;
typedef pair<int, int> pii;
typedef pair<ll, ll> pll;
#define INF 1<<30
#define LINF 1LL<<60

/*
<url:http://judge.u-aizu.ac.jp/onlinejudge/description.jsp?id=0505>
問題文============================================================
ある学校で修学旅行へ行く計画がある.そのためにアンケート調査を行った.
生徒は 1 から n までの生徒番号を持ち,旅行候補の場所を 1 から m までの番号で表し,
行きたい場所に ○,行きたくない場所に×の印をつけて提出している.
このとき, 行きたい場所の人数が多い順に,場所の番号を出力するプログラムを作成せよ.
人数が同じときは,場所の番号順とする.
入力データ の 1 行目は生徒の人数 n と旅行候補の場所の数 m が空白で区切られ, i + 1 行に
生徒 i のアンケート結果を ○ は 1 で×は 0 で表し,空白で区切られた m 個の数字が並んでいる.
1 ≤ n ≤ 1000, 1 ≤ m ≤ 100 とする.
=================================================================

入力=============================================================
入力は複数のデータセットからなる．n, m がともに 0 のとき入力が終了する．
データセットの数は 5 を超えない．
================================================================
出力=============================================================
データセットごとに、場所の番号 を１行に出力する．
================================================================

解説=============================================================
なし、実装
================================================================
*/
int main(void) {
	cin.tie(0); ios::sync_with_stdio(false);
	ll n, m;
	while (cin >> n >> m, n | m) {
		vector<pair<ll, ll>> vp(m);
		for (int i = 0; i < m;i++) vp[i] = { 0,-i};
		for (int i = 0; i < n;i++) {
			for (int j = 0; j < m;j++) {
				ll x; cin >> x;
				if (x == 1) {
					vp[j].first++;
				}
			}
		}
		sort(vp.begin(), vp.end());
		reverse(vp.begin(), vp.end());
		for (int i = 0; i < m;i++) {
			if (i != 0) cout << " ";
			cout << -vp[i].second + 1;
		}
		cout << endl;
	}
	return 0;
}