'''
 <url:https://yukicoder.me/problems/no/303>
 問題文============================================================
 =================================================================
 解説=============================================================
 フィボナッチ数列をF(L)とすると
 
 Lが奇数の時
    F(L)
 Lが偶数の時
    F(L)-F(L/2)**2
 が答え
 ただし例外としてL==2の時は
    3,INFを出力する
    
もちろん多売長が必要。。。。
 ================================================================
'''
def fib(L):
    a,b,c,d=1,1,1,0
    e,f,g,h=1,0,0,1
    while L > 0:
        if L%2==1:
            e,f,g,h=e*a+f*c,e*b+f*d,g*a+c*h,g*b+h*d
        a,b,c,d=a*a+b*c,a*b+b*d,a*c+d*c,c*b+d*d
        L>>=1
    return f

def calc(L):
    if L%2==1:
        return fib(L)
    else:
        a = fib(L)
        b = fib(L//2)
        return a - b**2

L=int(input())
if L == 2:
    print(3)
    print("INF")
else:
    print(L)
    print(calc(L))
